#Класс Train (Поезд):
#Имеет номер (произвольная строка) и тип (грузовой, пассажирский) и количество вагонов, эти данные указываются при создании экземпляра класса
#Может набирать скорость
#Может возвращать текущую скорость
#Может тормозить (сбрасывать скорость до нуля)
#Может возвращать количество вагонов
#Может прицеплять/отцеплять вагоны (по одному вагону за операцию, метод просто увеличивает или уменьшает количество вагонов). Прицепка/отцепка вагонов может осуществляться только если поезд не движется.
#Может принимать маршрут следования (объект класса Route).
#При назначении маршрута поезду, поезд автоматически помещается на первую станцию в маршруте.
#Может перемещаться между станциями, указанными в маршруте. Перемещение возможно вперед и назад, но только на 1 станцию за раз.
#Возвращать предыдущую станцию, текущую, следующую, на основе маршрута

class Train
  attr_accessor :speed

  attr_reader :carriage_count

  def initialize(number, type, carriage_count)
    @number = number
    @type = type
    @carriage_count = carriage_count
  end

  def change_carriage_count
    carriage_count += 1 if +
    carriage_count -= 1 if - and carriage_count > 0
  end

  def assign_route(rout)
    self.transfer +=1
  end

  def transfer(rout)

  end

end